Lai1207/STM32/6-2_Timer_External_clock/System/Timer.c
#include "stm32f10x.h"                  // Device header

extern uint16_t Num; 					//引入main.c 的變數

void Timer_Init(void){
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2,ENABLE);				//tim時鐘開啟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 ;
	GPIO_InitStructure.GPIO_Speed =GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure);
	
	TIM_ETRClockMode2Config(TIM2,TIM_ExtTRGPSC_OFF,TIM_ExtTRGPolarity_NonInverted,0x00);	//使用外部時鐘(預設)
	
	TIM_TimeBaseInitTypeDef TIM_TimerBaseStructure;
	TIM_TimerBaseStructure.TIM_ClockDivision = TIM_CKD_DIV1;		//時鐘分類 數位濾波器採樣速率
	TIM_TimerBaseStructure.TIM_CounterMode = TIM_CounterMode_Up;	//計數模式
	TIM_TimerBaseStructure.TIM_Period = 10 - 1;						//ARR
	TIM_TimerBaseStructure.TIM_Prescaler = 1 - 1;					//PSC
	TIM_TimerBaseStructure.TIM_RepetitionCounter = 0;				//重複計數器 這裡是使用通用所以不用
	
	TIM_TimeBaseInit(TIM2, &TIM_TimerBaseStructure);				//初始化時基單元
	
	TIM_ClearFlag(TIM2,TIM_IT_Update);								//手動清除中斷旗標
	TIM_ITConfig(TIM2, TIM_IT_Update, ENABLE);						//中斷控制
	
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
	
	NVIC_InitTypeDef NVIC_InitStructure;
	NVIC_InitStructure.NVIC_IRQChannel = TIM2_IRQn;
	NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
	NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 2;
	NVIC_InitStructure.NVIC_IRQChannelSubPriority = 1;
	
	NVIC_Init(&NVIC_InitStructure);
	
	TIM_Cmd(TIM2,ENABLE);											//啟用定時器
}

uint16_t Timer_GetCounter(void) 
{
	return TIM_GetCounter(TIM2); 									//cnt 計數值
}

void TIM2_IRQHandler (void){
	if(TIM_GetITStatus(TIM2,TIM_IT_Update)==SET){
		Num++;
		TIM_ClearITPendingBit(TIM2,TIM_IT_Update);
	}
}
